---
kind: type
id: T:Autodesk.Revit.DB.Analysis.HVACLoadType
source: html/90bf5784-0076-ded0-41fb-38fcb8ed6abe.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadType

The base class for building type and space type.

## Syntax (C#)
```csharp
public class HVACLoadType : Element
```